src/main/test/supply-chain/3-Calculation/0-Apply Tax/8-Tax Amounts/14-TC.03.07.10 - TaxAmount_per_TR_Combine/0-TC.03.07.10 - TaxAmount_per_TR_Combine/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
   <arg0><DocumentId>
    <SystemSourceId>COMPASS001</SystemSourceId>
    <TransactionId/>
  </DocumentId>
  <AlternateDocumentId>
    <CustomField1>CUSTOM_01</CustomField1>
    <CustomField2/>
    <CustomField3/>
    <CustomField4/>
    <CustomField5/>
    <CustomField6/>
    <CustomField7/>
    <CustomField8/>
    <CustomField9/>
    <CustomField10/>
  </AlternateDocumentId>
  <InvoiceLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </InvoiceLanguage>
  <CommunicationLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </CommunicationLanguage>
  <CalculationDecimalPlaces>2</CalculationDecimalPlaces>
  <PreviousInvoiceTaxCountry/>
  <TaxDecisionSet>
    <TaxDecisionSetId>1</TaxDecisionSetId>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_EXPZ</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Export Zero %</TaxIndicatorName>
                  <TaxIndicatorComment>Export of goods</TaxIndicatorComment>
               </SellerTaxIndicator>
               <SellerTaxCountry>CA</SellerTaxCountry>
               <SellerTaxState>CAQC</SellerTaxState>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_ZERO</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Zero%</TaxIndicatorName>
                  <TaxIndicatorComment>VAT zero-rated supply of goods</TaxIndicatorComment>
               </BuyerTaxIndicator>
               <BuyerTaxCountry>CA</BuyerTaxCountry>
               <BuyerTaxState>NULL</BuyerTaxState>
               <CombinedTaxIndicator>EXPZ</CombinedTaxIndicator>
               <CommercialIndicator>C</CommercialIndicator>
               <SellerTaxRegCountry>CA</SellerTaxRegCountry>
               <SellerTaxRegState>NULL</SellerTaxRegState>
               <BuyerTaxRegCountry>CA</BuyerTaxRegCountry>
               <BuyerTaxRegState>NULL</BuyerTaxRegState>

     
    <TaxComment>
      <TaxCommentType/>
      <TaxCommentText/>
    </TaxComment>
    <InvoiceCurrency>
      <CurrencyCode>EUR</CurrencyCode>
   
      <SellerLocalTaxCurrencyCode/>
    
      <BuyerLocalTaxCurrencyCode/>
    </InvoiceCurrency>
    <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
    <TaxInvoiceLine>
      <LineNumber>1</LineNumber>
      <ItemNo>1</ItemNo>
      <ItemType/>
      <UNSPSC>56000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.00</NetAmount>
     
    </TaxInvoiceLine>
    <TaxInvoiceLine>
      <LineNumber>2</LineNumber>
      <ItemNo>2</ItemNo>
      <ItemType/>
      <UNSPSC>10200000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.00</NetAmount>
     
    </TaxInvoiceLine>
     <TaxInvoiceLine>
      <LineNumber>3</LineNumber>
      <ItemNo>3</ItemNo>
      <ItemType/>
      <UNSPSC>10200000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.00</NetAmount>
     
    </TaxInvoiceLine>
  </TaxDecisionSet>
  
  <TaxDate>
    <TaxAlgorithmDate>2014-01-12</TaxAlgorithmDate>
    <TaxCalculationDate/>
  </TaxDate>
  <TaxModuleBehaviour>
    <SkipCalculation>N</SkipCalculation>
    <SkipDecision>Y</SkipDecision>
  </TaxModuleBehaviour>
  <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode>3101</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode>3101</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    <ResalePurpose>N</ResalePurpose>
    <IsOutBonded>N</IsOutBonded>
    <IsInBonded>N</IsInBonded>
    <TaxPreAlgorithmOutput>
      <IsExport>Y</IsExport>
      <IsImport>N</IsImport>
      <IsExported>N</IsExported>
      <IsImported>N</IsImported>
    </TaxPreAlgorithmOutput>
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>
  <BuyerParty>
    <Party>
      <BusinessUnitCode>3110</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName>RETAIL CENTERS MANAGEMENT</BusinessUnitName>
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode/>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
    
  </BuyerParty>
  <SellerParty>
    <Party>
      <BusinessUnitCode>3101</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName>IKEA STIFTUNG</BusinessUnitName>
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode/>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
   
  </SellerParty>
  <TermOfDelivery>TD-DDU</TermOfDelivery></arg0>
         </ws:applyTax>
   </soap:Body>
</soap:Envelope>